app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
	    @comment = @post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
INSERT INTO `comments` (`body`, `commenter`, `created_at`, `post_id`, `updated_at`) VALUES ('gfh', 'ghgf', '2014-03-05 11:43:53', 5, '2014-03-05 11:43:53')