app/controllers/posts_controller.rb

	def create
	  	@post = Post.new(post_params)

	  	if @post.save
---
INSERT INTO `posts` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2014-03-05 10:50:33', 'hello', 'First', '2014-03-05 10:50:33')

 	def show
		@post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 ORDER BY `posts`.`id` ASC LIMIT 1

	def destroy

		@post = Post.find(params[:id])
		@comment = Comment.where(post_id: @post.id)
		@comment.each do |comment|
		  comment.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 3

	def update
		 @post = Post.find(params[:id])

		  if @post.update(params[:post].permit(:title, :text))
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `title` = 'First1', `text` = 'hello2112', `updated_at` = '2014-03-05 10:51:02' WHERE `posts`.`id` = 1